#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cluster_profile.prodaws: Refreshing state... [id=60051eaa319e5f5791d60630]
spectrocloud_cluster_profile.prod-gcp: Refreshing state... [id=60051eaa319e5f579a6ae775]
spectrocloud_cluster_profile.prodvmware: Refreshing state... [id=600507d8319e5f4bf55eb6f1]
spectrocloud_cluster_profile.devvmware: Refreshing state... [id=600611eae9feb79bdc05b061]
spectrocloud_cluster_profile.azure: Refreshing state... [id=60051426319e5f5182759736]
spectrocloud_cluster_aws.cluster: Refreshing state... [id=60051eab319e5f57a610291e]
spectrocloud_cluster_gcp.cluster: Refreshing state... [id=60051eab319e5f57aaf10ae6]
spectrocloud_cluster_vsphere.comp-1: Refreshing state... [id=60061939e9feb79f43e33f66]
spectrocloud_cluster_vsphere.prod-vmware-2: Refreshing state... [id=60051eab319e5f579fc9962c]
spectrocloud_cluster_vsphere.prod-vmware-1: Refreshing state... [id=60051eab319e5f579e01b524]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spectrocloud_cluster_aws.cluster will be created
  + resource "spectrocloud_cluster_aws" "cluster" {
      + cloud_account_id   = "60010f4a042c47c320ef22a5"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60051eaa319e5f5791d60630"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "aws-picard-3"

      + cloud_config {
          + region       = "us-west-2"
          + ssh_key_name = "default"
        }

      + machine_pool {
          + azs                     = [
              + "us-west-2a",
            ]
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + disk_size_gb            = 65
          + instance_type           = "t3.large"
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"
        }
      + machine_pool {
          + azs                     = [
              + "us-west-2a",
            ]
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + disk_size_gb            = 62
          + instance_type           = "t3.large"
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"
        }
    }

  # spectrocloud_cluster_gcp.cluster will be created
  + resource "spectrocloud_cluster_gcp" "cluster" {
      + cloud_account_id   = "600517c4319e5f5481125dab"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60051eaa319e5f579a6ae775"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "gcp-picard-2"

      + cloud_config {
          + project = "spectro-common-dev2"
          + region  = "us-west3"
        }

      + machine_pool {
          + azs                     = [
              + "us-west3-a",
            ]
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 3
          + disk_size_gb            = 65
          + instance_type           = "e2-standard-2"
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"
        }
      + machine_pool {
          + azs                     = [
              + "us-west3-a",
            ]
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + disk_size_gb            = 62
          + instance_type           = "e2-standard-2"
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"
        }
    }

  # spectrocloud_cluster_vsphere.prod-vmware-1 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-1" {
      + cloud_account_id   = "60021028b8f15e1b049bfaf6"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "600507d8319e5f4bf55eb6f1"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-1"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-1"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster1"
              + datastore = "datastore55"
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster1"
              + datastore = "datastore55"
              + network   = "VM Network"
            }
        }

      + pack {
          + name   = "lb-metallb"
          + tag    = "0.8.x"
          + values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.10-10.10.182.18
            EOT
        }
    }

  # spectrocloud_cluster_vsphere.prod-vmware-2 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-2" {
      + cloud_account_id   = "60021028b8f15e1b049bfaf6"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "600507d8319e5f4bf55eb6f1"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-2"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-1"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster1"
              + datastore = "datastore55"
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster1"
              + datastore = "datastore55"
              + network   = "VM Network"
            }
        }

      + pack {
          + name   = "lb-metallb"
          + tag    = "0.8.x"
          + values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.20-10.10.182.29
            EOT
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `sandbox`, Workflow: `Terraform Plan`*